tap "armmbed/formulae"
tap "derailed/k9s"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "k0sproject/tap"
tap "knative/client"
tap "kubecolor/tap"
tap "minio/stable"
tap "oven-sh/bun"
tap "surrealdb/tap"
brew "ack"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "fribidi"
brew "lz4"
brew "libtiff"
brew "gdk-pixbuf"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "libssh"
brew "libyaml"
brew "ansible"
brew "openjdk"
brew "antlr"
brew "apr"
brew "apr-util"
brew "argocd"
brew "aria2"
brew "libnet"
brew "arping"
brew "m4"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "oniguruma"
brew "bat"
brew "bat-extras"
brew "bdw-gc"
brew "berkeley-db"
brew "biome"
brew "protobuf"
brew "bloaty"
brew "bottom"
brew "gmp"
brew "btop"
brew "bundletool"
brew "caddy"
brew "cdrtools"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "csvlens"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "curl"
brew "deno"
brew "doggo"
brew "dosfstools"
brew "libtool"
brew "eza"
brew "fd"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "gnutls"
brew "libarchive"
brew "snappy"
brew "ffmpeg"
brew "ffsend"
brew "libuv"
brew "firebase-cli"
brew "ncurses"
brew "fish"
brew "flyctl"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow"
brew "gitlab-runner", restart_service: true
brew "gleam"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "libgcrypt"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "gopass"
brew "grpcurl"
brew "libpthread-stubs"
brew "gstreamer"
brew "guile"
brew "helix"
brew "helm"
brew "helmfile"
brew "htop"
brew "httpie"
brew "httping"
brew "hugo"
brew "libheif"
brew "imagemagick"
brew "incus"
brew "ipcalc"
brew "iperf3"
brew "ipmitool"
brew "iproute2mac"
brew "istioctl"
brew "jenv"
brew "jpeg"
brew "jq"
brew "k3sup"
brew "k9s"
brew "kotlin"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "lazygit"
brew "ldns"
brew "lego"
brew "libcbor"
brew "libffi"
brew "libfido2"
brew "libftdi"
brew "libslirp"
brew "libtermkey"
brew "libzip"
brew "livekit-cli"
brew "llvm"
brew "llvm@17"
brew "lsusb"
brew "lua"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "lux"
brew "make"
brew "mas"
brew "ninja"
brew "micropython"
brew "minicom"
brew "minikube"
brew "minio"
brew "minio-mc"
brew "mosquitto"
brew "yt-dlp"
brew "mpv"
brew "msgpack"
brew "mtr"
brew "mysql"
brew "neovim"
brew "netcat"
brew "nmap"
brew "nushell"
brew "open-ocd"
brew "openssh"
brew "parallel"
brew "pass"
brew "pcre"
brew "perl"
brew "picocom"
brew "picotool"
brew "pinentry-mac"
brew "pocketbase"
brew "postgresql@16"
brew "potrace"
brew "progress"
brew "pwgen"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "qsv"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "rustup-init"
brew "s3cmd"
brew "screen"
brew "screenresolution"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sipcalc"
brew "six"
brew "socat"
brew "sops"
brew "speedtest-cli"
brew "spice-gtk"
brew "ssh-copy-id"
brew "starship"
brew "stylua"
brew "subversion"
brew "swaks"
brew "swiftformat"
brew "tealdeer"
brew "telnet"
brew "terraform-docs"
brew "the_silver_searcher"
brew "tig"
brew "tio"
brew "tmate"
brew "tmux"
brew "totp-cli"
brew "translate-shell"
brew "vercel-cli"
brew "viddy"
brew "vim"
brew "virt-manager"
brew "watch"
brew "websocat"
brew "wget"
brew "whois"
brew "wireguard-go"
brew "wireguard-tools"
brew "yadm"
brew "ykman"
brew "yq"
brew "zellij"
brew "zig"
brew "zoxide"
brew "zsh"
brew "hashicorp/tap/terraform"
brew "k0sproject/tap/k0sctl"
brew "kubecolor/tap/kubecolor"
brew "oven-sh/bun/bun"
brew "surrealdb/tap/surreal"
cask "adrive"
cask "arc"
cask "baidunetdisk"
cask "bitwarden"
cask "discord"
cask "feishu"
cask "figma"
cask "firefox"
cask "font-geist-mono-nerd-font"
cask "font-inconsolata"
cask "font-monaspace-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gstreamer-runtime"
cask "iina"
cask "jetbrains-toolbox"
cask "lm-studio"
cask "logitech-options"
cask "neteasemusic"
cask "netnewswire"
cask "notion"
cask "nrlquaker-winbox"
cask "obs"
cask "ollama"
cask "orbstack"
cask "postman"
cask "proxyman"
cask "qqmusic"
cask "raycast"
cask "remoteviewer"
cask "steam"
cask "surge"
cask "tailscale"
cask "telegram"
cask "tencent-meeting"
cask "the-unarchiver"
cask "thunder"
cask "tinymediamanager"
cask "visual-studio-code"
cask "warp"
cask "wechat"
cask "wezterm"
cask "wine-stable"
cask "wireshark"
cask "yubico-yubikey-manager"
cask "zed"
mas "iStatistica Pro", id: 1447778660
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
vscode "antfu.iconify"
vscode "antfu.unocss"
vscode "astro-build.astro-vscode"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "codezombiech.gitignore"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hyoretsu.code-spell-checker-language-pack"
vscode "matthewpi.caddyfile-support"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-catalan"
vscode "streetsidesoftware.code-spell-checker-croatian"
vscode "streetsidesoftware.code-spell-checker-czech"
vscode "streetsidesoftware.code-spell-checker-danish"
vscode "streetsidesoftware.code-spell-checker-dutch"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "streetsidesoftware.code-spell-checker-greek"
vscode "streetsidesoftware.code-spell-checker-hebrew"
vscode "streetsidesoftware.code-spell-checker-italian"
vscode "streetsidesoftware.code-spell-checker-medical-terms"
vscode "streetsidesoftware.code-spell-checker-persian"
vscode "streetsidesoftware.code-spell-checker-polish"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "streetsidesoftware.code-spell-checker-russian"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "streetsidesoftware.code-spell-checker-swedish"
vscode "streetsidesoftware.code-spell-checker-turkish"
vscode "streetsidesoftware.code-spell-checker-ukrainian"
vscode "streetsidesoftware.code-spell-checker-vietnamese"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
