tap "cloudflare/cloudflare"
tap "derailed/k9s"
tap "drone/drone"
tap "github/gh"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "heroku/brew"
tap "hidetatz/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
tap "juicedata/tap"
tap "k0sproject/tap"
tap "knative/client"
tap "kubecolor/tap"
tap "librespeed/tap"
tap "minio/stable"
tap "tektoncd/tools"
tap "wez/wezterm"
brew "ack"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "libffi"
brew "pkg-config"
brew "libpthread-stubs"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pcre"
brew "pixman"
brew "cairo"
brew "fribidi"
brew "libtiff"
brew "gdk-pixbuf"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "libyaml"
brew "python@3.10"
brew "six"
brew "ansible"
brew "ansible-lint"
brew "apr"
brew "apr-util"
brew "argocd"
brew "aria2"
brew "libnet"
brew "arping"
brew "m4"
brew "autoconf"
brew "automake"
brew "bash"
brew "bat"
brew "bat-extras"
brew "bdw-gc"
brew "berkeley-db", link: true
brew "bottom"
brew "caddy", restart_service: true
brew "cdrtools"
brew "cilium-cli"
brew "clang-format"
brew "cloc"
brew "clusterctl"
brew "cmake"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "cowsay"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "lz4"
brew "curl"
brew "deno"
brew "dosfstools"
brew "editorconfig"
brew "etcd", restart_service: true
brew "exa"
brew "fd"
brew "gmp"
brew "libtool"
brew "guile"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "gnutls"
brew "jpeg", link: true
brew "libarchive"
brew "gobject-introspection"
brew "snappy"
brew "ffmpeg"
brew "ffsend"
brew "figlet"
brew "ncurses"
brew "fish"
brew "fnm"
brew "frpc"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow"
brew "gitui"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "libgcrypt"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gopass"
brew "gping"
brew "grpcurl"
brew "helix"
brew "helm"
brew "helmfile"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "ipcalc"
brew "iperf3"
brew "ipmitool"
brew "iproute2mac"
brew "istioctl"
brew "oniguruma"
brew "jq"
brew "k3sup"
brew "k9s"
brew "kind"
brew "kompose"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "ldns"
brew "libcbor"
brew "libfido2"
brew "libslirp"
brew "libssh"
brew "libtermkey"
brew "libuv"
brew "libzip"
brew "qemu"
brew "lima"
brew "links"
brew "lolcat"
brew "lsusb"
brew "lua"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "lxc"
brew "macchina"
brew "mas"
brew "minicom"
brew "minikube"
brew "minio"
brew "minio-mc"
brew "msgpack"
brew "mtr"
brew "protobuf"
brew "mysql", restart_service: true
brew "screenresolution"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nmap"
brew "nushell"
brew "openjdk"
brew "openssh"
brew "pass"
brew "perl"
brew "pgloader"
brew "pinentry-mac"
brew "pnpm"
brew "postgresql@14"
brew "pre-commit"
brew "progress"
brew "pup"
brew "pwgen"
brew "pyenv"
brew "ranger"
brew "rargs"
brew "redis", restart_service: true
brew "rename"
brew "ripgrep"
brew "rsync"
brew "rustup-init"
brew "s3cmd"
brew "screen"
brew "shfmt"
brew "sipcalc"
brew "sk"
brew "slides"
brew "socat"
brew "sops"
brew "speedtest-cli"
brew "spice-gtk"
brew "ssh-copy-id"
brew "starship"
brew "step"
brew "stow"
brew "stylua"
brew "subversion"
brew "swiftformat"
brew "tektoncd-cli"
brew "telnet"
brew "terraform"
brew "terraform-docs"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmate"
brew "tmux"
brew "translate-shell"
brew "transmission-cli"
brew "vault", restart_service: true
brew "vim"
brew "virt-manager"
brew "watch"
brew "wget"
brew "whois"
brew "wiki"
brew "wireguard-go"
brew "wireguard-tools"
brew "yadm"
brew "ykman"
brew "youtube-dl"
brew "yq"
brew "zellij"
brew "zsh"
brew "cloudflare/cloudflare/cloudflared"
brew "drone/drone/drone"
brew "hashicorp/tap/terraform-ls"
brew "heroku/brew/heroku"
brew "k0sproject/tap/k0sctl"
brew "kubecolor/tap/kubecolor"
brew "librespeed/tap/librespeed-cli"
cask "1password"
cask "alacritty"
cask "aliwangwang"
cask "android-studio"
cask "baidunetdisk"
cask "balenaetcher"
cask "clashx"
cask "discord"
cask "electron-fiddle"
cask "feishu"
cask "firefox"
cask "fleet"
cask "flutter"
cask "font-jetbrains-mono"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iina"
cask "iterm2"
cask "kitty"
cask "maccy"
cask "microsoft-remote-desktop"
cask "nrlquaker-winbox"
cask "obs"
cask "picgo"
cask "powershell"
cask "qqmusic"
cask "qtpass"
cask "raspberry-pi-imager"
cask "rectangle"
cask "remoteviewer"
cask "rustdesk"
cask "squidman"
cask "syncthing"
cask "tabby"
cask "tailscale"
cask "telegram"
cask "tencent-meeting"
cask "the-unarchiver"
cask "thunder"
cask "transmission"
cask "transmission-remote-gui"
cask "vagrant"
cask "visual-studio-code"
cask "warp"
cask "webstorm"
cask "wechat"
cask "wezterm"
cask "wine-stable"
cask "wireshark"
cask "youtube-downloader"
cask "yubico-yubikey-manager"
cask "zerotier-one"
mas "Infuse", id: 1136220934
mas "iStatistica Pro", id: 1447778660
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
