tap "armmbed/formulae"
tap "cloudflare/cloudflare"
tap "derailed/k9s"
tap "drone/drone"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
tap "k0sproject/tap"
tap "knative/client"
tap "kubecolor/tap"
tap "minio/stable"
tap "oven-sh/bun"
tap "surrealdb/tap"
brew "ack"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre2"
brew "glib"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "fribidi"
brew "lz4"
brew "libtiff"
brew "gdk-pixbuf"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "libyaml"
brew "six"
brew "ansible"
brew "openjdk"
brew "antlr"
brew "apr"
brew "apr-util"
brew "argocd"
brew "aria2"
brew "gmp"
brew "arm-none-eabi-gdb"
brew "libnet"
brew "arping"
brew "m4"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "oniguruma"
brew "bat"
brew "bat-extras"
brew "bdw-gc"
brew "berkeley-db", link: true
brew "protobuf"
brew "bloaty"
brew "bottom"
brew "btop"
brew "cdrtools"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "cowsay"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "curl"
brew "deno"
brew "doggo"
brew "dosfstools"
brew "eza"
brew "fd"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "gnutls"
brew "libarchive"
brew "snappy"
brew "ffmpeg"
brew "ffsend"
brew "ncurses"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-flow"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "libgcrypt"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "gopass"
brew "grpcurl"
brew "libpthread-stubs"
brew "libtool"
brew "guile"
brew "helix"
brew "helm"
brew "helmfile"
brew "htop"
brew "httpie"
brew "httping"
brew "hugo"
brew "libheif"
brew "imagemagick"
brew "ipcalc"
brew "iperf3"
brew "ipmitool"
brew "iproute2mac"
brew "istioctl"
brew "jpeg"
brew "jq"
brew "k3sup"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "lazygit"
brew "ldns"
brew "lego"
brew "libcbor"
brew "libffi"
brew "libfido2"
brew "libftdi"
brew "libslirp"
brew "libssh"
brew "libtermkey"
brew "libuv"
brew "libzip"
brew "livekit-cli"
brew "llvm"
brew "lsusb"
brew "lua"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "lxc"
brew "make"
brew "mas"
brew "micropython"
brew "minicom"
brew "minikube"
brew "minio"
brew "minio-mc"
brew "mitmproxy"
brew "mosquitto"
brew "msgpack"
brew "mtr"
brew "mysql"
brew "screenresolution"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "ninja"
brew "pcre"
brew "nmap"
brew "nushell"
brew "open-ocd"
brew "openssh"
brew "parallel"
brew "pass"
brew "perl"
brew "picocom"
brew "picotool"
brew "pinentry-mac"
brew "pocketbase"
brew "postgresql@15"
brew "potrace"
brew "progress"
brew "pup"
brew "pwgen"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "rustup-init"
brew "s3cmd"
brew "screen"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sipcalc"
brew "socat"
brew "sops"
brew "speedtest-cli"
brew "spice-gtk"
brew "ssh-copy-id"
brew "starship"
brew "stylua"
brew "subversion"
brew "swaks"
brew "swiftformat"
brew "tealdeer"
brew "telnet"
brew "terraform"
brew "terraform-docs"
brew "the_silver_searcher"
brew "tig"
brew "tio"
brew "tmate"
brew "tmux"
brew "totp-cli"
brew "translate-shell"
brew "vercel-cli"
brew "vim"
brew "virt-manager"
brew "watch"
brew "websocat"
brew "wget"
brew "whois"
brew "wireguard-go"
brew "wireguard-tools"
brew "yadm"
brew "ykman"
brew "yq"
brew "zellij"
brew "zig"
brew "zoxide"
brew "zsh"
brew "cloudflare/cloudflare/cloudflared"
brew "drone/drone/drone"
brew "k0sproject/tap/k0sctl"
brew "kubecolor/tap/kubecolor"
brew "oven-sh/bun/bun"
brew "surrealdb/tap/surreal"
cask "1password"
cask "adrive"
cask "arc"
cask "baidunetdisk"
cask "discord"
cask "docker"
cask "feishu"
cask "figma"
cask "firefox"
cask "flutter"
cask "font-ubuntu-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iina"
cask "jetbrains-toolbox"
cask "notion"
cask "nrlquaker-winbox"
cask "postman"
cask "qqmusic"
cask "raycast"
cask "rectangle"
cask "remoteviewer"
cask "squirrel"
cask "surge"
cask "tailscale"
cask "telegram"
cask "tencent-meeting"
cask "the-unarchiver"
cask "thunder"
cask "tinymediamanager"
cask "transmission"
cask "vagrant"
cask "visual-studio-code"
cask "warp"
cask "webstorm"
cask "wechat"
cask "wezterm"
cask "wine-stable"
cask "wireshark"
cask "yubico-yubikey-manager"
cask "zerotier-one"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "iStatistica Pro", id: 1447778660
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
vscode "antfu.unocss"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "cperezabo.routeros-syntax"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hollowtree.vue-snippets"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "platformio.platformio-ide"
vscode "Prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "wayou.vscode-todo-highlight"
vscode "zhuangtongfa.material-theme"
vscode "ZixuanChen.vitest-explorer"
vscode "zxh404.vscode-proto3"
